Yoda49/PIC24E-GPIO-REMAP-DEFINES/PIC24E_gpio_remap_output.h
#ifndef __PIC24E_GPIO_REMAP_OUTPUT_H__
#define __PIC24E_GPIO_REMAP_OUTPUT_H__

// ***********************************************************
// PIN OUTPUT CONFIGURATION REMAP
// OUPUT_PIN_xxx (RPx) = OUTPUT_PER_xxx
// ***********************************************************

// ==============
// PERIPHERALS
// ==============
#define OUTPUT_PER_UART1_TX  0b000001
#define OUTPUT_PER_UART1_RTS 0b000010
#define OUTPUT_PER_UART2_TX  0b000011
#define OUTPUT_PER_UART2_RTS 0b000100
#define OUTPUT_PER_SPI1_MOSI 0b000101
#define OUTPUT_PER_SPI1_CLK  0b000110
#define OUTPUT_PER_SPI1_SS   0b000111
#define OUTPUT_PER_SPI2_SS   0b001010
#define OUTPUT_PER_DCI_TX    0b001011
#define OUTPUT_PER_DCI_CLK   0b001100
#define OUTPUT_PER_DCI_FSYNC 0b001101
#define OUTPUT_PER_CAN1_TX   0b001110
#define OUTPUT_PER_CAN2_TX   0b001111
#define OUTPUT_PER_OC1_OUT   0b010000
#define OUTPUT_PER_OC2_OUT   0b010001
#define OUTPUT_PER_OC3_OUT   0b010010
#define OUTPUT_PER_OC4_OUT   0b010011
#define OUTPUT_PER_OC5_OUT   0b010100
#define OUTPUT_PER_OC6_OUT   0b010101
#define OUTPUT_PER_OC7_OUT   0b010110
#define OUTPUT_PER_OC8_OUT   0b010111
#define OUTPUT_PER_C1_OUT    0b011000
#define OUTPUT_PER_C2_OUT    0b011001
#define OUTPUT_PER_C3_OUT    0b011010
#define OUTPUT_PER_UART3_TX  0b011011
#define OUTPUT_PER_UART3_RTS 0b011100
#define OUTPUT_PER_UART4_TX  0b011101
#define OUTPUT_PER_UART4_RTS 0b011110
#define OUTPUT_PER_SPI3_MOSI 0b011111
#define OUTPUT_PER_SPI3_CLK  0b100000
#define OUTPUT_PER_SPI3_SS   0b100001
#define OUTPUT_PER_SPI4_MOSI 0b100010
#define OUTPUT_PER_SPI4_CLK  0b100011
#define OUTPUT_PER_SPI4_SS   0b100100
#define OUTPUT_PER_OC9       0b100101
#define OUTPUT_PER_OC10      0b100110
#define OUTPUT_PER_OC11      0b100111
#define OUTPUT_PER_OC12      0b101000
#define OUTPUT_PER_OC13      0b101001
#define OUTPUT_PER_OC14      0b101010
#define OUTPUT_PER_OC15      0b101011
#define OUTPUT_PER_OC16      0b101100
#define OUTPUT_PER_SYNCO1    0b101101
#define OUTPUT_PER_SYNCO2    0b101110
#define OUTPUT_PER_QEI1CCMP  0b101111
#define OUTPUT_PER_QEI2CCMP  0b110000
#define OUTPUT_PER_REFCLK    0b110001


#define OUTPUT_PIN_RP64      RPOR0bits.RP64R
#define OUTPUT_PIN_RP65      RPOR0bits.RP65R
#define OUTPUT_PIN_RP66      RPOR1bits.RP66R
#define OUTPUT_PIN_RP67      RPOR1bits.RP67R
#define OUTPUT_PIN_RP68      RPOR2bits.RP68R
#define OUTPUT_PIN_RP69      RPOR2bits.RP69R
#define OUTPUT_PIN_RP70      RPOR3bits.RP70R
#define OUTPUT_PIN_RP71      RPOR3bits.RP71R
#define OUTPUT_PIN_RP79      RPOR4bits.RP79R
#define OUTPUT_PIN_RP80      RPOR4bits.RP80R
#define OUTPUT_PIN_RP82      RPOR5bits.RP82R
#define OUTPUT_PIN_RP84      RPOR5bits.RP84R
#define OUTPUT_PIN_RP85      RPOR6bits.RP85R
#define OUTPUT_PIN_RP87      RPOR6bits.RP87R
#define OUTPUT_PIN_RP96      RPOR7bits.RP96R
#define OUTPUT_PIN_RP97      RPOR7bits.RP97R
#define OUTPUT_PIN_RP98      RPOR8bits.RP98R
#define OUTPUT_PIN_RP99      RPOR8bits.RP99R
#define OUTPUT_PIN_RP100     RPOR9bits.RP100R
#define OUTPUT_PIN_RP101     RPOR9bits.RP101R
#define OUTPUT_PIN_RP102     RPOR10bits.RP102R
#define OUTPUT_PIN_RP104     RPOR11bits.RP104R
#define OUTPUT_PIN_RP108     RPOR11bits.RP108R
#define OUTPUT_PIN_RP109     RPOR12bits.RP109R
#define OUTPUT_PIN_RP112     RPOR12bits.RP112R
#define OUTPUT_PIN_RP113     RPOR13bits.RP113R
#define OUTPUT_PIN_RP118     RPOR13bits.RP118R
#define OUTPUT_PIN_RP120     RPOR14bits.RP120R
#define OUTPUT_PIN_RP125     RPOR14bits.RP125R
#define OUTPUT_PIN_RP126     RPOR15bits.RP126R
#define OUTPUT_PIN_RP127     RPOR15bits.RP127R


#endif

